# የፊደላትን ድግግሞሽ መጠን ማውጣት
print("\n-------------------------------------")
የሚገባ_ቃል=input("እባክዎን የሚፈልጉትን ቃል ያስገቡ: ")
print("ያስገቡት ቃል \"", የሚገባ_ቃል,"\" ነው።")
ስብስብ = set()
for ሆሄ in የሚገባ_ቃል:
    ስብስብ.add(ሆሄ)

ሆሄያት_መቁጠሪያ = dict()
for አባል in ስብስብ:
    if አባል==" ":
        continue
    ሆሄ_መያዣ = የሚገባ_ቃል.count(አባል)
    ሆሄያት_መቁጠሪያ[አባል] = ሆሄ_መያዣ
    print("ፊደል {}" " {} ጊዜ ተገኝቷል።".format(አባል,ሆሄ_መያዣ))
print("\n")
for አባል in ስብስብ:
    if አባል==(len(ሆሄያት_መቁጠሪያ)-1):
        print("{}""" "{} ጊዜ".format(አባል,ሆሄ_መያዣ))
    if አባል==" ":
        continue
    print("{} {} ጊዜ".format(አባል,ሆሄ_መያዣ),end=" ፣ ")
print("ተገኝተዋል ።")
print("\n-----------------------------------------\n")
